var injectKetaka=function(start,end,text,mrkps) {
  var out=text;
  if(!mrkps)return out;
  //console.log(text);
  for(var i=0; i<mrkps.length; i++){//mrkps[chief,mrkpStart,mrkpLen,mrkpPb,mrkpText]
  	var mrkpStart = mrkps[i][1], mrkpLen = mrkps[i][2], mrkpText = mrkps[i][4];
    //console.log(mrkpStart);
  	out = out.substr(0,mrkpStart-start)+mrkpText+out.substr(mrkpStart-start+mrkpLen+1);
  }

  console.log(out);
	return out;
}

var text = " བུའི་ཆོས་ཀྱི་སྒོ་དག་བསྟན་པའི་དུས་ནི་འདི་ལགས། ཚོང་ནི་འདི་ལགས་ཀྱིས་དེ་ལྟ་བུའི་ཆོས་ཀྱི་སྒོ་དག་བཤད་ཅིང་དེ་ལྟ་བུའི་ཆོས་བསྟན་པ་ཉེ་བར་བསྒྲུབ་ཏུ་གསོལ་། བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཀྱང་ཇི་ལྟར་བསམ་གྱིས་མི་ཁྱབ་པའི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་ཤིང་ཐམས་ཅད་ཀྱང་སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ་དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྨིན་པ་ཤ་སྟག་ལགས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་ཆོས་ཀྱི་ཚུལ་ཚད་མ་མཆིས་པ་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པའི་གཞིར་འགྱུར་བ་དང་། དེས་པའི་ཚིགས་གི་དོན་ཐམས་ཅད་རྟོག་ཤིང་སྟོན་པར་འགྱུར་བ་དང་། འཚལ་ན་བྱང་ཆུབ་མངོན་བར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དང་། འཚལ་ན་རྫུ་འཕྲུལ་གྱི་སྟོབས་མཐའ་ཡས་པ་དག་ལ་གནས་ནས་སེམས་ཅན་ཚད་མ་མཆིས་པ་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཀུན་དུ་གཟུང་བ་ལ་མཁས་པར་བགྱི་བའི་སླད་དུ་དེ་བཞིན་གཤེགས་པས་དེ་དག་ལ་གཟུངས་ཀྱི་སྒོ་ལ་མཁས་པ་དེ་ལྟ་བུ་དེ་ག་ཉེ་བར་བསྒྲུབ་ཏུ་གསོལ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པས་དེ་ལྟ་བུའི་ཆོས་ཀྱི་སྒོ་དག་ཡང་དག་པར་རབ་ཏུ་བཤད་ན་སེམས་ཅན་དཔག་ཏུ་མེད་མཆིས་པ་དག་ཀྱང་བྱང་ཆུབ་ཀྱི་ལམ་ལ་མཁས་ཤིང་ཡོངས་སུ་སྨིན་པར་འགྱུར་རོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་སྔོན་ཡུན་རིང་པོ་ནས་སེམས་ཅན་ཚད་མ་མཆིས་དཔག་ཏུ་མ་མཆིས་པ་དག་སངས་རྒྱས་ཀྱི་མཁྱེན་པ་དང། རང་བྱུང་གི་ཡེ་ཤེས་ལ་སོ་སོར་དགོད་པར་སྨོན་ལམ་མཛད་པ་དེའི་དུས་ནི་འདི་ལགས་ཀྱིས། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་འདི་དག་རང་རང་གི་";
//var m = [["",100,2,0,"XXXXX"],["",50,2,0,"XXXXX"],["",5,2,0,"XXXXX"]];
var m = [[ 'T.Gawa', 1158, 6, 7, 'ཀྱིས། ' ],
  [ 'T.Gawa', 807, 5, 7, 'བཅོམ་' ],
  [ 'T.Gawa', 801, 6, 7, 'གསོལ། ' ],
  [ 'T.Gawa', 783, 2, 7, '' ],
  [ 'T.Gawa', 780, 3, 7, 'དག་' ],
  [ 'T.Gawa', 137, 7, 7, 'གསོལ། ' ],
  [ 'T.Gawa', 45, 4, 7, 'ཚོད་' ]];
injectKetaka(0,1000,text,m);